In [7]:
!pip install faker

Collecting faker
  Downloading faker-37.0.0-py3-none-any.whl.metadata (15 kB)
Requirement already satisfied: tzdata in c:\users\admin\anaconda3\lib\site-packages (from faker) (2023.3)
Downloading faker-37.0.0-py3-none-any.whl (1.9 MB)
   ---------------------------------------- 0.0/1.9 MB ? eta -:--:--
   -------------------------------- ------- 1.6/1.9 MB 8.3 MB/s eta 0:00:01
   ---------------------------------------- 1.9/1.9 MB 6.2 MB/s eta 0:00:00
Installing collected packages: faker
Successfully installed faker-37.0.0

In [8]:
from faker import Faker
import pandas as pd

# Initialize Faker
fake = Faker()

# Generate 100 rows of fake data
data = {
    "Name": [fake.name() for _ in range(100)],
    "Address": [fake.address() for _ in range(100)],
    "Date": [fake.date() for _ in range(100)]
}

# Create a DataFrame
df = pd.DataFrame(data)

# Save to CSV (optional)
df.to_csv("amazon_delivery.csv", index=False)

# Display the first 5 rows
print(df.head())

                Name                                            Address  \
0    Brandon Leonard           24891 Hurst Manor\nMartinville, ME 64449
1      Sarah Gardner  66393 James Curve Apt. 284\nEast Laurenchester...
2          Kim Solis       09489 Morgan Fields\nWilsonchester, GA 13032
3         Kelly Cook         5642 Damon Rest\nChristopherbury, AS 81958
4  Christine Watkins  41010 Tyler Club Suite 498\nVelazqueztown, AS ...

         Date
0  2000-10-21
1  1974-08-24
2  2021-06-12
3  1993-06-13
4  1982-05-31

In [11]:
fake = Faker()

df = pd.DataFrame({"Name": [fake.name() for _ in range(20)]})

print(df)

                    Name
0             Brian Hall
1        Richard Vasquez
2          Kenneth Blake
3          Heather Jones
4            Jose Knight
5             Mary Myers
6          Mallory Davis
7            Judith Bell
8             Lisa Perry
9           Kevin Moreno
10        Nichole Zuniga
11  Christopher Williams
12         Jacob Andrews
13          Carrie Ayers
14        Brandon Berger
15        John Rodriguez
16            Karen King
17          Mark Elliott
18        Christina Soto
19           Maria Olsen

In [13]:
fake = Faker()

df = pd.DataFrame({"Email": [fake.email() for _ in range(20)]})

print(df)

                           Email
0       patelbrandon@example.com
1        cassandra06@example.org
2          kristin41@example.org
3         nschneider@example.org
4         blairdiana@example.net
5           walter06@example.net
6            haley59@example.net
7   madisonmacdonald@example.net
8     robinsonsherry@example.com
9          lisawhite@example.org
10          carlos38@example.net
11          vallison@example.com
12           gmorris@example.net
13            amills@example.com
14     ericalexander@example.com
15       billshields@example.net
16        debrabates@example.com
17     annahernandez@example.org
18      williamevans@example.com
19     laurenbarnett@example.org

In [17]:
from faker import Faker
from datetime import datetime
import pandas as pd
fake = Faker()

# Generate fake dates of birth
num_samples = 10  # Change this number as needed
dob_list = [fake.date_of_birth(minimum_age=18, maximum_age=80) for _ in range(num_samples)]

# Convert DOB to Age
current_year = datetime.today().year
ages = [current_year - dob.year for dob in dob_list]

# Create DataFrame
df = pd.DataFrame({'Date of Birth': dob_list, 'Age': ages})
print(df)

  Date of Birth  Age
0    1960-04-15   65
1    1949-02-25   76
2    1944-04-01   81
3    1977-07-28   48
4    1960-07-31   65
5    1999-07-11   26
6    1952-08-13   73
7    1972-05-17   53
8    1996-05-04   29
9    1950-05-02   75

In [21]:
import random
# Generate fake product names
product_names = [f'Product_{i}' for i in range(1, 11)]  # 10 fake product names
prices = [round(random.uniform(10, 500), 2) for _ in range(10)]  # Random prices between 10 and 500

# Create DataFrame
df = pd.DataFrame({'Product_Name': product_names, 'Price': prices})

# Display DataFrame
df

  Product_Name   Price
0    Product_1  349.53
1    Product_2  157.76
2    Product_3  272.49
3    Product_4  205.86
4    Product_5  312.85
5    Product_6  203.67
6    Product_7  183.01
7    Product_8  434.25
8    Product_9  385.82
9   Product_10  167.84

In [23]:
# Initialize Faker
fake = Faker()

# Generate fake data
num_records = 10  # Adjust as needed
data = {
    "Name": [fake.name() for _ in range(num_records)],
    "City": [fake.city() for _ in range(num_records)],
    "Phone Number": [fake.phone_number() for _ in range(num_records)]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
df

                Name             City          Phone Number
0  Rebecca Hernandez       Patelshire    434-363-9746x90303
1    Matthew Ramirez        New Chris    957-288-8433x36149
2      Michael Smith    North Melissa          484-723-5528
3         Lisa Jones        Dianastad   (212)482-4869x99867
4   Madeline Griffin    Lake Markbury    (714)975-1328x3676
5       Brenda Zhang   New Georgestad     557.308.6851x4983
6       Randy Orozco   East Jamesfort   +1-427-362-3403x866
7         John House        Smithfort     662-749-9391x5669
8        Terry Young  North Hollystad  +1-536-605-4681x4627
9   Daniel Hernandez    Williamsville     371.836.7438x3852

In [25]:
                                    #MERGE : MERGING DATAFRAME

In [31]:

# Sample DataFrames
df1 = pd.DataFrame({'Product_ID': [1, 2, 3], 'Price': [100, 200, 300]})
df2 = pd.DataFrame({'Product_ID': [1, 2, 4], 'Stock': [10, 20, 30]})

# Merge on 'Product_ID'
merged_df = pd.merge(df1, df2, on='Product_ID', how='inner')

# Display result
print(merged_df)

   Product_ID  Price  Stock
0           1    100     10
1           2    200     20

In [33]:
df1 = pd.DataFrame({'Employee_ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'Employee_ID': [2, 3, 4], 'Salary': [50000, 60000, 70000]})

# Left Join
merged_df = df1.merge(df2, on='Employee_ID', how='left')

# Display result
print(merged_df)

   Employee_ID     Name   Salary
0            1    Alice      NaN
1            2      Bob  50000.0
2            3  Charlie  60000.0

In [35]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 35]})

# Left join
merged_df = df1.merge(df2, on='ID', how='left')

# Display result
merged_df

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  25.0
2   3  Charlie  30.0

In [39]:
df1 = pd.DataFrame({'City': ['New York', 'Los Angeles', 'Chicago'], 'Age': [25, 30, 35], 'Salary': [50000, 60000, 70000]})
df2 = pd.DataFrame({'City': ['New York', 'Los Angeles', 'Chicago'], 'Age': [25, 30, 35], 'Department': ['IT', 'HR', 'Finance']})

# Merging on multiple columns
merged_df = pd.merge(df1, df2, on=['City', 'Age'])

# Display result
print(merged_df)

          City  Age  Salary Department
0     New York   25   50000         IT
1  Los Angeles   30   60000         HR
2      Chicago   35   70000    Finance

In [41]:
# Sample DataFrames
df1 = pd.DataFrame({'Country': ['USA', 'Canada', 'India'], 'Population': [331, 38, 1380]})
df2 = pd.DataFrame({'Country': ['USA', 'India', 'UK'], 'GDP': [21.4, 2.9, 2.7]})

# Inner Join on 'Country'
merged_df = pd.merge(df1, df2, on='Country', how='inner')

# Display result
print(merged_df)

  Country  Population   GDP
0     USA         331  21.4
1   India        1380   2.9

In [43]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [85, 90, 78]})

# Merging DataFrames (Left Join)
merged_df = df1.merge(df2, on='ID', how='left')

# Display result
merged_df

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   85.0
2   3  Charlie   90.0